export const passwordReg =
  /^(?=.*[A-Z])(?=.*[a-z])(?=.*\d)[A-Za-z\d`~!@#$%^&*()_+-=,.?]{8,20}$/;

export const phoneReg = /^1[3|4|5|6|7|8|9][0-9]{9}$/;

export const emailReg =
  /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;

export const userList = [
  {
    id: 1,
    name: "刘明豪",
    age: "28",
    job: "超酷的工作",
  },
  {
    id: 2,
    name: "小豪子",
    age: "23",
    job: "前端工程师",
  },
  {
    id: 3,
    name: "大豪哥",
    age: "28",
    job: "后端工程师",
  },
];
